{
  "backend/main.mo": "Actor defining storage, access control, and data models for episodes, characters, clans, gallery items, news, scripts, pro blocks, fan mail, collaborations, and support requests.",
  "feature_evidence.json": "Structured feature evidence report mapping feature IDs to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-like text listing human-written summaries for various frontend files and components.",
  "frontend/index.css": "Tailwind base styles defining color variables, dark mode values, and global background/text styling.",
  "frontend/index.html": "Basic HTML entry point loading the root div and main.tsx module.",
  "frontend/src/App.tsx": "Main React app component handling hash-based routing for main, admin, pro, and secret views and rendering all site sections.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Component gating admin access using Internet Identity and admin checks, showing login, unauthorized, or dashboard states.",
  "frontend/src/components/admin/AdminDashboardView.tsx": "Provides the admin dashboard layout with tab navigation linking to all content management panels.",
  "frontend/src/components/admin/panels/CharactersAdminPanel.tsx": "Implements CRUD management for characters, including metadata encoding/decoding and form dialogs.",
  "frontend/src/components/admin/panels/ClansAdminPanel.tsx": "Handles clan creation, editing, deletion, and metadata processing with dialog-based forms.",
  "frontend/src/components/admin/panels/CollaborationAdminPanel.tsx": "Displays collaboration requests, supports viewing detailed request data, and sorts entries by timestamp.",
  "frontend/src/components/admin/panels/EpisodesAdminPanel.tsx": "Provides full episode CRUD, reordering, metadata fields, and thumbnail upload/validation.",
  "frontend/src/components/admin/panels/FanMailAdminPanel.tsx": "Shows fan mail messages, allows replying via dialog, and sorts messages by submission time.",
  "frontend/src/components/admin/panels/GalleryAdminPanel.tsx": "Provides a full CRUD interface for gallery items, including file upload, metadata handling, and tagging characters or clans.",
  "frontend/src/components/admin/panels/NewsAdminPanel.tsx": "Manages news posts with create, edit, and delete dialogs using simple text fields.",
  "frontend/src/components/admin/panels/ScriptsAdminPanel.tsx": "Allows admins to create, edit, and delete scripts, handling authorization errors and basic text form inputs.",
  "frontend/src/components/admin/panels/SupporterHelpAdminPanel.tsx": "Displays supporter help requests in a sortable list with a detail dialog for viewing full messages.",
  "frontend/src/components/admin/panels/TeamAdminPanel.tsx": "Provides role management for team members, enabling admins to grant or revoke roles and add new principals.",
  "frontend/src/components/affinity/AffinityResultsCard.tsx": "Displays a detailed affinity match card with character portrait, descriptions, and animated visual effects.",
  "frontend/src/components/affinity/affinityScoring.ts": "Initializes character scores and computes the highest‑matching character with a calculated soul resonance percentage.",
  "frontend/src/components/affinity/affinityShareUtils.ts": "Builds share text and provides clipboard and Web Share API utilities for sharing affinity results.",
  "frontend/src/components/affinity/affinityTypes.ts": "Defines character ID union types and interfaces for affinity scoring and match results.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity status with loading and error handling.",
  "frontend/src/components/characters/CharacterCard.tsx": "Displays a character card with portrait, clan styling, details, and motion‑aware animations.",
  "frontend/src/components/characters/CreateCharacterDialog.tsx": "Provides a dialog form for creating new characters, including metadata encoding and mutation handling.",
  "frontend/src/components/clans/ClanBadge.tsx": "Shows a compact badge for a clan with accent color styling and optional motion effects.",
  "frontend/src/components/clans/ClanCard.tsx": "Displays a full clan card with sigil, badge, description, and animated visual effects.",
  "frontend/src/components/common/GlowingGlassPanel.tsx": "Simple wrapper component that renders children inside a styled glowing glass panel.",
  "frontend/src/components/episodes/EpisodeCard.tsx": "Renders episode information with status, summary, and an optional watch button.",
  "frontend/src/components/episodes/EpisodePlayerDialog.tsx": "Displays episode details in a dialog and plays a video if available, otherwise shows an unavailable alert.",
  "frontend/src/components/gallery/ArtistLeaderboard.tsx": "Renders a leaderboard of artists with ranks, badges, and a profile dialog trigger, handling loading and error states.",
  "frontend/src/components/gallery/ArtistProfileDialog.tsx": "Shows an artist’s profile with stats, badges, and artworks, including a lightbox viewer and loading fallback.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Displays gallery items in a responsive grid with optional category tabs and image click handling.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Provides a fullscreen lightbox for navigating images with keyboard support and optional admin deletion.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Implements a dialog for uploading gallery artwork with drag‑and‑drop, form fields, validation, and submission.",
  "frontend/src/components/gallery/HallOfFame.tsx": "Displays featured artist cards with artwork, achievements, and a lightbox viewer sourced from mock data.",
  "frontend/src/components/news/NewPostForm.tsx": "Provides a form for creating news posts with validation, error display, and submit handling.",
  "frontend/src/components/news/NewsPostCard.tsx": "Renders a news post with title, author, formatted timestamp, and content inside a styled panel.",
  "frontend/src/components/pro/ProModeGate.tsx": "Restricts access to Pro mode content based on authentication and admin status, redirecting unauthorized users.",
  "frontend/src/components/pro/proPresentationCodec.ts": "Encodes and decodes Pro presentation blocks to and from JSON with structure validation.",
  "frontend/src/components/pro/ProPresentationSection.tsx": "Loads, displays, and edits Pro presentation blocks with scroll reveal and Pro-mode editing controls.",
  "frontend/src/components/pro/proPresentationStore.ts": "Zustand store managing Pro presentation blocks with add, update, remove, and initialization logic.",
  "frontend/src/components/pro/proPresentationTypes.ts": "Defines TypeScript interfaces for Pro presentation blocks and documents.",
  "frontend/src/components/pro/ProToolbar.tsx": "Toolbar for adding blocks and saving Pro presentation updates, with save status and error handling.",
  "frontend/src/components/quiz/quizScoring.ts": "Initializes clan scores and determines quiz results, including tie-breaking and a special balance outcome.",
  "frontend/src/components/quiz/ResultsCard.tsx": "Displays quiz results with clan styling, sigil, personality text, and optional secret badge.",
  "frontend/src/components/quiz/shareUtils.ts": "Provides utilities to copy quiz results to clipboard and a placeholder for exporting results as images.",
  "frontend/src/components/secrets/secretProgress.ts": "Manages secret discovery progress in localStorage, providing load, save, update, and reset utilities.",
  "frontend/src/components/secrets/SecretVaultSection.tsx": "React section displaying secret vault progress, unlocked lore, characters, and artwork with modal previews and reset support.",
  "frontend/src/components/sections/AboutSection.tsx": "Animated About section presenting story overview and feature cards with reveal-on-scroll effects.",
  "frontend/src/components/sections/CharacterAffinityMatcherSection.tsx": "Interactive affinity quiz that updates character scores, computes match results, and provides sharing options.",
  "frontend/src/components/sections/CharactersSection.tsx": "Loads and displays character cards, supports admin character creation, and applies metadata decoding.",
  "frontend/src/components/sections/ClanPersonalityQuizSection.tsx": "Clan personality quiz that tracks answers, calculates a result, and allows copying quiz outcomes.",
  "frontend/src/components/sections/ClansSection.tsx": "Fetches clans, merges backend metadata with static styling, and displays animated clan cards with a fallback plus an embedded world map.",
  "frontend/src/components/sections/CollaborationForm.tsx": "Provides a collaboration request form with validation, mutation submission, success feedback, and error handling.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders the contact page with fan mail form, static contact info, and animated section reveal.",
  "frontend/src/components/sections/DonationSection.tsx": "Displays themed donation tiers with animated reveal and stylized background imagery.",
  "frontend/src/components/sections/EpisodesSection.tsx": "Loads and decodes episodes, shows loading/error states, and opens a player dialog for released episodes.",
  "frontend/src/components/sections/FanMailForm.tsx": "Implements a fan mail submission form with validation, mutation handling, success messages, and error alerts.",
  "frontend/src/components/sections/Footer.tsx": "Renders the footer with quick links, social icons, branding, and smooth-scroll behavior.",
  "frontend/src/components/sections/GallerySection.tsx": "Fetches, filters, and displays gallery items with sorting, lightbox, uploads, and admin actions.",
  "frontend/src/components/sections/HeaderNav.tsx": "Provides a responsive navigation bar with scroll behavior, smooth scrolling, mobile menu, and admin link.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the hero banner with parallax background, animated particles, and stylized title content.",
  "frontend/src/components/sections/NewsUpdatesSection.tsx": "Handles news fetching, admin post creation, user profile setup, and renders a scroll-reveal news feed.",
  "frontend/src/components/sections/PowerSystemDatabaseSection.tsx": "Displays a searchable database of power types, rules, forbidden techniques, and character abilities using tabs and animated sections.",
  "frontend/src/components/sections/SupporterHelpForm.tsx": "Implements a validated support request form with mutation submission, success feedback, and error handling.",
  "frontend/src/components/sections/WorldMapHotspotsOverlay.tsx": "Renders interactive SVG hotspots over a world map, handling clicks, keyboard events, and storing element refs.",
  "frontend/src/components/sections/WorldMapLoreDialog.tsx": "Shows a dialog with lore for a selected map location and triggers secret unlocks based on specific regions.",
  "frontend/src/components/sections/WorldMapSection.tsx": "Combines the world map image, hotspots overlay, and lore dialog with scroll animations and focus management.",
  "frontend/src/data/affinityCharacters.ts": "Defines affinity character metadata including personality, fighting style, story role, and portrait paths.",
  "frontend/src/data/affinityQuizQuestions.ts": "Defines interfaces and a list of affinity quiz questions with answer options mapped to character score weights.",
  "frontend/src/data/characters.ts": "Provides character definitions with clan, personality, powers, and roles for major story figures.",
  "frontend/src/data/clanQuizQuestions.ts": "Contains quiz questions for determining clan alignment, each with answers scoring various clans.",
  "frontend/src/data/clanQuizResults.ts": "Lists clan result profiles with personality descriptions, including a secret Balance Clan.",
  "frontend/src/data/clans.ts": "Defines clan metadata such as descriptions, colors, and sigil asset paths.",
  "frontend/src/data/episodes.ts": "Provides Season 1 episode metadata including titles, summaries, and release status.",
  "frontend/src/data/gallery.ts": "Declares gallery item structure and an empty gallery list with predefined categories.",
  "frontend/src/data/powerSystemDatabase.ts": "Describes power types, ability rules, forbidden techniques, and character ability data for the power system.",
  "frontend/src/data/secretLore.ts": "Defines interfaces and arrays for lore fragments, hidden character info, and bonus artwork used in the game's world-building data.",
  "frontend/src/data/worldMapLocations.ts": "Provides typed world map location data including coordinates, clan affiliations, lore text, and SVG hotspot shapes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/useParallax.ts": "Offers a hook that applies parallax scrolling effects to an element unless reduced-motion preferences are enabled.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's OS-level reduced‑motion preference using a media query.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend API calls with React Query hooks for user profiles, admin checks, news, episodes, and other data.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Provides a hook that reveals an element when scrolled into view using IntersectionObserver, respecting reduced‑motion settings.",
  "frontend/src/index.css": "Sets global Tailwind layers, OKLCH color variables, dark mode themes, fonts, and custom glow utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global CSS.",
  "frontend/src/types/fanArtCommunity.ts": "Defines TypeScript interfaces for artist leaderboards, profiles, artworks, and hall of fame entries.",
  "frontend/src/utils/adminContentAdapters.ts": "Provides helpers to encode/decode metadata in text fields and retrieve clan styling defaults.",
  "frontend/src/utils/galleryImageUpload.ts": "Validates image uploads by type and size and converts them to data URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, container settings, and plugin integrations.",
  "project_state.json": "Describes the project's state, existing features, new feature requests, and version metadata."
}