{
  "backend/main.mo": "Motoko canister defining state for users, episodes, characters, clans, gallery items, news, scripts, and ProBlocks with admin‑protected update APIs and presentation editing.",
  "feature_evidence.json": "Feature evidence report listing donation section, navigation update, and App integration with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries for numerous frontend files describing styling, features, hooks, and component behavior.",
  "frontend/index.css": "Base Tailwind CSS variables and theming definitions for light and dark modes plus global background and border setup.",
  "frontend/index.html": "Root HTML skeleton containing the app mount point and script loader for the React frontend.",
  "frontend/src/App.tsx": "Main React app routing between main, admin, and pro views and rendering all public sections including the DonationSection before the footer.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Gate component that checks identity and admin status to show loading, login, unauthorized message, or the admin dashboard.",
  "frontend/src/components/admin/AdminDashboardView.tsx": "Renders the admin dashboard with navigation, authentication, and tabbed panels for managing all content types. Handles routing via URL hash changes and conditionally shows the Team tab for admins.",
  "frontend/src/components/admin/panels/CharactersAdminPanel.tsx": "Provides CRUD UI for characters, including metadata encoding/decoding and clan selection. Manages form dialogs, validation, and mutation calls.",
  "frontend/src/components/admin/panels/ClansAdminPanel.tsx": "Implements create, edit, and delete functionality for clans with metadata handling. Includes form dialogs, validation, and error/loading states.",
  "frontend/src/components/admin/panels/EpisodesAdminPanel.tsx": "Handles episode creation, editing, deletion, ordering, and thumbnail upload/validation. Supports tagging characters, visibility modes, and production checklist fields.",
  "frontend/src/components/admin/panels/GalleryAdminPanel.tsx": "Manages gallery items with image upload/processing, metadata encoding, and CRUD dialogs. Provides form validation and editing for descriptions and categories.",
  "frontend/src/components/admin/panels/NewsAdminPanel.tsx": "Admin UI for listing, creating, editing, and deleting news posts using query hooks and dialogs.",
  "frontend/src/components/admin/panels/ScriptsAdminPanel.tsx": "Admin panel to manage scripts with create, edit, and delete flows including permission error handling.",
  "frontend/src/components/admin/panels/TeamAdminPanel.tsx": "Interface for admins to assign and revoke user roles, view team members, and validate principals.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache reset.",
  "frontend/src/components/characters/CharacterCard.tsx": "Displays a character's portrait, clan styling, and details with animations and error fallback.",
  "frontend/src/components/characters/CreateCharacterDialog.tsx": "Dialog to create a new character, encode metadata, and submit via mutation with basic validation.",
  "frontend/src/components/clans/ClanBadge.tsx": "Renders a styled badge showing a clan's name and accent color with optional motion effects.",
  "frontend/src/components/clans/ClanCard.tsx": "Animated clan info card showing sigil, badge, and description with motion-aware effects.",
  "frontend/src/components/episodes/EpisodeCard.tsx": "Displays episode number, title, status, summary, and optional watch button.",
  "frontend/src/components/episodes/EpisodePlayerDialog.tsx": "Dialog that plays an episode video or shows an unavailable alert.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Gallery grid with optional category tabs and clickable images that trigger a callback.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Lightbox dialog for viewing gallery images with navigation and keyboard controls.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Dialog for uploading and validating gallery images with metadata and mutation submission.",
  "frontend/src/components/news/NewPostForm.tsx": "Form for creating news posts with validation, error display, and submit handling.",
  "frontend/src/components/news/NewsPostCard.tsx": "Card showing a news post’s title, author, timestamp, and content.",
  "frontend/src/components/pro/ProModeGate.tsx": "Checks admin authentication and renders children only for authorized users, otherwise redirects out of Pro mode.",
  "frontend/src/components/pro/proPresentationCodec.ts": "Encodes and decodes Pro presentation blocks to and from JSON with basic validation and error handling.",
  "frontend/src/components/pro/ProPresentationSection.tsx": "Loads, displays, and edits Pro presentation blocks with animations and conditional Pro-mode behavior.",
  "frontend/src/components/pro/proPresentationStore.ts": "Zustand store managing Pro presentation blocks including add, update, remove, and ensuring a default block.",
  "frontend/src/components/pro/proPresentationTypes.ts": "Defines TypeScript interfaces for Pro presentation blocks and documents.",
  "frontend/src/components/pro/ProToolbar.tsx": "Provides controls to add blocks and save Pro presentation changes, handling success, errors, and unauthorized states.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an animated story section with feature cards using reveal-on-scroll effects.",
  "frontend/src/components/sections/CharactersSection.tsx": "Fetches and displays character cards, supports admin creation, and handles loading and error states.",
  "frontend/src/components/sections/ClansSection.tsx": "Displays clan cards using backend or fallback data, with animations, error handling, and an integrated world map.",
  "frontend/src/components/sections/DonationSection.tsx": "Animated donation section with Cash App details and styled content card using scroll reveal.",
  "frontend/src/components/sections/EpisodesSection.tsx": "Fetches and decodes episode data, displays episode cards with loading and error states, and opens a player dialog.",
  "frontend/src/components/sections/Footer.tsx": "Footer with brand info, quick navigation links, social icons, and scroll reveal animations.",
  "frontend/src/components/sections/GallerySection.tsx": "Loads gallery items with admin upload support, displays grid, handles lightbox interaction, and falls back to static data.",
  "frontend/src/components/sections/HeaderNav.tsx": "Responsive navigation bar with scroll detection, smooth section scrolling, mobile menu, and admin link.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with parallax background, particle effects, animated gradients, and prominent title content.",
  "frontend/src/components/sections/NewsUpdatesSection.tsx": "Displays news posts with admin creation, user login, and profile setup, using hooks for fetching and animating content.",
  "frontend/src/components/sections/WorldMapHotspotsOverlay.tsx": "Renders interactive SVG hotspot regions on the world map and forwards refs for click and keyboard activation.",
  "frontend/src/components/sections/WorldMapLoreDialog.tsx": "Shows a dialog with detailed lore for a selected map location, including its name, region, and text.",
  "frontend/src/components/sections/WorldMapSection.tsx": "Combines the world map image, hotspot overlay, and lore dialog to allow users to explore regions and view descriptions.",
  "frontend/src/data/characters.ts": "Defines character data, including clans, personalities, abilities, and roles for various story characters.",
  "frontend/src/data/clans.ts": "Provides metadata for each clan such as descriptions, colors, and sigil paths.",
  "frontend/src/data/episodes.ts": "Lists Season 1 episodes with titles, summaries, release status, and optional media fields.",
  "frontend/src/data/gallery.ts": "Defines gallery item structure and category list, currently with an empty gallery array.",
  "frontend/src/data/worldMapLocations.ts": "Defines the WorldMapLocation interface and a list of map location objects with coordinates, metadata, lore, and SVG shapes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor via React Query, updating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, handling login, logout, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useParallax.ts": "Implements a hook that applies a scroll-based parallax transform to an element with reduced‑motion support.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's prefers-reduced-motion setting and updates in response to system changes.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for profiles, roles, episodes, and other application data operations.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Provides an IntersectionObserver-based hook that reveals elements when they enter the viewport, respecting reduced‑motion settings.",
  "frontend/src/index.css": "Defines Tailwind layers plus custom color variables and various anime-style visual effects and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/adminContentAdapters.ts": "Provides encode/decode helpers for embedding metadata in text fields and utilities for retrieving clan styling from static data.",
  "frontend/src/utils/galleryImageUpload.ts": "Validates uploaded images by type and size, converts them to data URLs, and exposes size limits for gallery, episodes, and characters.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session parameters for routing and admin token persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind theme with custom colors, clan palettes, shadows, and plugin extensions for typography, animations, and container queries.",
  "project_state.json": "Defines the project’s current state, goals, architecture notes, known issues, and existing features for the anime site build."
}