{
  "backend/main.mo": "Primary canister actor defining state, types, and APIs for episodes, characters, clans, gallery, news, scripts, and ProBlocks with admin authorization and storage mixins.",
  "backend/migration.mo": "Migration module converting OldCharacter to NewCharacter by adding portraitUrl and returning updated actor state on upgrade.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs for character portrait enhancements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of key frontend files including hooks, sections, and styling.",
  "frontend/index.css": "Base Tailwind CSS layer defining theme variables for light/dark modes and applying global background and text styles.",
  "frontend/index.html": "Basic HTML entrypoint mounting the root React element and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React app that switches between main site, admin, and pro modes using hash-based routing.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Gate component that checks identity and admin status to show login prompt, unauthorized message, or the admin dashboard.",
  "frontend/src/components/admin/AdminDashboardView.tsx": "Renders the main admin dashboard with tabs for managing site content, navigation controls, and conditional admin-only sections.",
  "frontend/src/components/admin/panels/CharactersAdminPanel.tsx": "Provides CRUD UI for characters, including metadata encoding, clan selection, and portrait upload handling.",
  "frontend/src/components/admin/panels/ClansAdminPanel.tsx": "Implements clan management with creation, editing, deletion, and metadata encoding for clan details.",
  "frontend/src/components/admin/panels/EpisodesAdminPanel.tsx": "Handles creating, editing, reordering, and deleting episodes with thumbnail uploads and production‑progress fields.",
  "frontend/src/components/admin/panels/GalleryAdminPanel.tsx": "Manages gallery items with image upload, metadata encoding, and CRUD dialogs for artwork entries.",
  "frontend/src/components/admin/panels/NewsAdminPanel.tsx": "Admin UI for listing, creating, editing, and deleting news posts using query hooks and dialog forms.",
  "frontend/src/components/admin/panels/ScriptsAdminPanel.tsx": "Admin panel to manage scripts with create, update, delete, and permission-aware error handling.",
  "frontend/src/components/admin/panels/TeamAdminPanel.tsx": "Interface for managing team roles, granting and revoking permissions, and validating admin access.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication state and query cache clearing.",
  "frontend/src/components/characters/CharacterCard.tsx": "Animated character display card showing portrait, clan color accents, and character details.",
  "frontend/src/components/clans/ClanBadge.tsx": "Small badge showing a clan’s name and accent color with optional motion effects.",
  "frontend/src/components/clans/ClanCard.tsx": "Detailed animated clan card featuring sigil, badge, description, and visual effects.",
  "frontend/src/components/episodes/EpisodeCard.tsx": "Episode preview card displaying episode metadata and an optional watch button.",
  "frontend/src/components/episodes/EpisodePlayerDialog.tsx": "Displays an episode in a dialog with title, summary, and an embedded video player or a missing-video alert.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Renders a filterable image grid with category tabs and click handling for opening images.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Shows a full-screen lightbox for gallery images with keyboard navigation and next/previous controls.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Provides a dialog for uploading and validating gallery images, including drag‑and‑drop and metadata submission.",
  "frontend/src/components/news/NewPostForm.tsx": "Form for creating news posts with validation, error display, and submit handling.",
  "frontend/src/components/news/NewsPostCard.tsx": "Displays a news post with title, author, formatted timestamp, and content.",
  "frontend/src/components/pro/ProModeGate.tsx": "Restricts content to authenticated admins and redirects unauthorized users by clearing the hash.",
  "frontend/src/components/pro/proPresentationCodec.ts": "Encodes and decodes Pro presentation blocks to and from JSON with basic validation.",
  "frontend/src/components/pro/ProPresentationSection.tsx": "Manages and displays editable presentation blocks in Pro mode or read-only blocks otherwise, loading saved data on mount.",
  "frontend/src/components/pro/proPresentationStore.ts": "Zustand store managing Pro presentation blocks with add, update, remove, and initialization helpers.",
  "frontend/src/components/pro/proPresentationTypes.ts": "Defines ProBlock and ProPresentationDocument type structures.",
  "frontend/src/components/pro/ProToolbar.tsx": "UI toolbar for adding text blocks and saving Pro presentation content via mutation.",
  "frontend/src/components/sections/AboutSection.tsx": "Animated About/Story section showing feature cards with icons and reveal effects.",
  "frontend/src/components/sections/CharactersSection.tsx": "Fetches characters, decodes metadata, and displays character cards with loading and error states.",
  "frontend/src/components/sections/ClansSection.tsx": "Loads clans, merges backend metadata with static styling, displays clan cards, and includes world map section.",
  "frontend/src/components/sections/EpisodesSection.tsx": "Fetches episodes, decodes metadata, lists episodes, and opens a player dialog for released ones.",
  "frontend/src/components/sections/Footer.tsx": "Footer with brand info, navigation links, social icons, and reveal-on-scroll animation.",
  "frontend/src/components/sections/GallerySection.tsx": "Loads gallery items from backend or static fallback, handles lightbox and upload dialog, and displays a grid of images with optional admin upload button.",
  "frontend/src/components/sections/HeaderNav.tsx": "Provides a responsive navigation bar with scroll effects, smooth section scrolling, mobile menu, and optional admin link.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders the animated hero section with parallax background, particle effects, and title content respecting reduced‑motion preferences.",
  "frontend/src/components/sections/NewsUpdatesSection.tsx": "Displays news posts with loading/error states, profile setup flow, admin post creation, and sorted post listing.",
  "frontend/src/components/sections/WorldMapHotspotsOverlay.tsx": "Draws clickable SVG hotspots over a world map, managing refs and keyboard interaction to trigger location selection.",
  "frontend/src/components/sections/WorldMapLoreDialog.tsx": "Shows a dialog with lore details for a selected map location, including title, region, clan, and descriptive text.",
  "frontend/src/components/sections/WorldMapSection.tsx": "React section displaying a world map with interactive hotspots, animated reveal effects, and a lore dialog for selected regions.",
  "frontend/src/data/characters.ts": "Defines the Character interface and a list of character profiles with clan, personality, powers, and roles.",
  "frontend/src/data/clans.ts": "Defines the Clan interface and data for each clan, including descriptions, colors, and sigil asset paths.",
  "frontend/src/data/episodes.ts": "Provides the Episode interface and Season 1 episode list with titles, summaries, status, and optional media URLs.",
  "frontend/src/data/gallery.ts": "Defines gallery item types and a small set of gallery entries with categories and image metadata.",
  "frontend/src/data/worldMapLocations.ts": "Contains world map location definitions with coordinates, clan ties, lore text, and SVG path shapes for hotspots.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refreshing queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling login, identity loading, status tracking, and AuthClient setup.",
  "frontend/src/hooks/useParallax.ts": "Provides a hook that applies scroll-based parallax transforms to an element, respecting reduced-motion preferences.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's prefers-reduced-motion setting and updates on system changes.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for user profiles, roles, episodes, and admin actions.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Implements scroll-triggered reveal animations using IntersectionObserver with reduced-motion support.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom anime-themed color variables and animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/adminContentAdapters.ts": "Provides encode/decode helpers for embedding metadata in text fields and resolves styling from clan data.",
  "frontend/src/utils/galleryImageUpload.ts": "Validates image uploads by type and size and converts them to data URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, shadows, and extended theme utilities for the site's UI.",
  "project_state.json": "Project metadata describing the anime website’s goals, architecture notes, known issues, and existing feature definitions."
}