{
  "backend/main.mo": "Primary Motoko actor defining state, types, and CRUD logic for users, episodes, characters, clans, gallery, news, and scripts with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module converting old actor state to the new episode format, mapping fields and injecting defaults for new properties.",
  "feature_evidence.json": "Feature evidence report listing required frontend updates, affected files, components, and associated test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality and roles of various frontend files and components.",
  "frontend/index.css": "Tailwind base/theme variables and global styling definitions for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling hash-based routing between the marketing site and admin dashboard.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Access gate that checks identity and admin status to show login, unauthorized message, or the admin dashboard.",
  "frontend/src/components/admin/AdminDashboardView.tsx": "Renders the main admin dashboard with tabs for managing content panels and a header with navigation and login controls. Conditionally includes the team panel based on admin status.",
  "frontend/src/components/admin/panels/CharactersAdminPanel.tsx": "Provides UI and logic for listing, creating, editing, and deleting characters with metadata encoding. Supports clan selection and character metadata handling.",
  "frontend/src/components/admin/panels/ClansAdminPanel.tsx": "Allows admins to view, create, edit, and delete clans with encoded metadata. Includes form dialogs and error handling for clan content management.",
  "frontend/src/components/admin/panels/EpisodesAdminPanel.tsx": "Manages episodes with creation, editing, deletion, reordering, thumbnail uploads, and character tagging. Handles visibility settings and progress states for production steps.",
  "frontend/src/components/admin/panels/GalleryAdminPanel.tsx": "Supports CRUD for gallery items with image upload, metadata encoding, and preview handling. Provides dialogs for creating and editing gallery entries.",
  "frontend/src/components/admin/panels/NewsAdminPanel.tsx": "Admin panel for listing, creating, editing, and deleting news posts with form validation and query mutations.",
  "frontend/src/components/admin/panels/ScriptsAdminPanel.tsx": "Admin interface to manage scripts, including creation, editing, deletion, and permission-based error handling.",
  "frontend/src/components/admin/panels/TeamAdminPanel.tsx": "Admin tool for listing team members and granting or revoking roles, with validation and authorization checks.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading state and automatic query cache clearing.",
  "frontend/src/components/characters/CharacterCard.tsx": "Displays a character's portrait, clan styling, and details with animated presentation and motion‑sensitive effects.",
  "frontend/src/components/clans/ClanBadge.tsx": "Small badge showing a clan's name and accent color with subtle animated effects.",
  "frontend/src/components/clans/ClanCard.tsx": "Animated card presenting a clan's sigil, badge, and description with hover effects and motion‑aware visuals.",
  "frontend/src/components/episodes/EpisodeCard.tsx": "Card showing episode metadata, release status, and an optional watch button.",
  "frontend/src/components/episodes/EpisodePlayerDialog.tsx": "Modal dialog that displays episode details and either a playable video or an unavailable alert.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Renders a filterable grid of gallery images with optional category tabs and click handling.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Full-screen lightbox viewer with keyboard navigation and previous/next controls for gallery images.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Dialog for uploading new gallery images with drag-and-drop, validation, and metadata submission.",
  "frontend/src/components/news/NewPostForm.tsx": "Form for creating a news post with validation, error display, and submission handling.",
  "frontend/src/components/news/NewsPostCard.tsx": "Displays a formatted news post with title, author, timestamp, and content.",
  "frontend/src/components/sections/AboutSection.tsx": "Animated about section highlighting story context and three feature cards with icons.",
  "frontend/src/components/sections/CharactersSection.tsx": "Fetches and decodes character data, displays loading/error states, and renders CharacterCard components with scroll-based animation.",
  "frontend/src/components/sections/ClansSection.tsx": "Loads clan data, merges backend metadata with static styling, handles loading/error states, and renders ClanCard components plus an embedded world map section.",
  "frontend/src/components/sections/EpisodesSection.tsx": "Retrieves and decodes episode data, sorts episodes, handles watch actions with gating for unreleased content, and renders EpisodeCard components and a player dialog.",
  "frontend/src/components/sections/Footer.tsx": "Renders the site footer with brand info, quick navigation links, social icons, and scroll-triggered animations.",
  "frontend/src/components/sections/GallerySection.tsx": "Loads and decodes gallery items, supports admin uploads, displays a gallery grid with lightbox navigation, and handles loading/error states.",
  "frontend/src/components/sections/HeaderNav.tsx": "Implements a responsive navigation bar with scroll detection, smooth section navigation, mobile menu, and an admin link when authorized.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders the landing hero section with parallax background, animated particles, gradients, and introductory title content. Uses motion preferences and DOM manipulation to create floating particle effects.",
  "frontend/src/components/sections/NewsUpdatesSection.tsx": "Displays a news feed with authentication, profile setup, admin post creation, and sorted news posts. Handles loading states, errors, and a modal for entering a user profile name.",
  "frontend/src/components/sections/WorldMapHotspotsOverlay.tsx": "Renders an SVG overlay of clickable map hotspots tied to location data. Manages hotspot refs, keyboard accessibility, and motion‑aware visual effects.",
  "frontend/src/components/sections/WorldMapLoreDialog.tsx": "Shows a modal dialog presenting lore details for a selected map location. Includes region metadata, close controls, and styled text content.",
  "frontend/src/components/sections/WorldMapSection.tsx": "Combines the world map image, clickable hotspots, and lore dialog into an interactive map section. Handles selection, dialog state, focus return, and enter‑on‑scroll animations.",
  "frontend/src/data/characters.ts": "Defines a Character interface and exports a list of character entries describing their clan, personality, powers, and narrative roles. Used as static data for character-related features.",
  "frontend/src/data/clans.ts": "Defines a Clan interface and a list of clan metadata including names, descriptions, colors, and sigil paths.",
  "frontend/src/data/episodes.ts": "Defines Episode interface and provides Season 1 episode data with titles, summaries, and release status.",
  "frontend/src/data/gallery.ts": "Defines gallery item structure and exports a small set of gallery items and category list.",
  "frontend/src/data/worldMapLocations.ts": "Defines map location interface and exports detailed lore-based map location data with coordinates and SVG shapes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useParallax.ts": "Provides a hook that applies scroll-based parallax effects with reduced-motion support.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced-motion preference via a media query.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for user profiles, roles, episodes, and related mutations.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Hook for revealing elements when scrolled into view using IntersectionObserver with reduced-motion fallback.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme CSS variables, and custom anime‑style glow, shimmer, pulse, fade, and float utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context and loads global styles.",
  "frontend/src/utils/adminContentAdapters.ts": "Provides helpers to encode/decode metadata in text fields and retrieve clan styling defaults.",
  "frontend/src/utils/galleryImageUpload.ts": "Validates image uploads for size/type and converts files to data URLs.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors, shadows, radii, and enabling plugins and CSS variable‑driven color system.",
  "project_state.json": "Describes project goals, architecture notes, issues, and existing features for the anime website."
}