{
  "backend/main.mo": "Motoko backend actor defining storage, types, and state for content such as episodes, characters, clans, gallery items, news, scripts, pro blocks, fan mail, and collaboration/support requests.",
  "feature_evidence.json": "Feature evidence report mapping new collaboration and support-request features to their related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and key behavior of multiple frontend files including sections, hooks, config, and UI components.",
  "frontend/index.css": "Global Tailwind-based CSS defining design tokens, theming variables for light and dark mode, and base element styling.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads the main entry script.",
  "frontend/src/App.tsx": "Top-level React app with hash-based routing for main, admin, and pro modes and rendering of all major site sections.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Admin gate component handling Internet Identity auth, admin checks, loading states, and unauthorized messaging with principal copying.",
  "frontend/src/components/admin/AdminDashboardView.tsx": "Renders the admin dashboard with tab navigation to different content management panels.",
  "frontend/src/components/admin/panels/CharactersAdminPanel.tsx": "Provides CRUD UI for characters, including metadata encoding and form dialogs for create and edit.",
  "frontend/src/components/admin/panels/ClansAdminPanel.tsx": "Offers CRUD management for clans with metadata handling and form dialogs for creation and editing.",
  "frontend/src/components/admin/panels/CollaborationAdminPanel.tsx": "Displays and sorts collaboration requests with a dialog for viewing request details.",
  "frontend/src/components/admin/panels/EpisodesAdminPanel.tsx": "Handles episode creation, editing, reordering, and thumbnail upload with extensive form controls.",
  "frontend/src/components/admin/panels/FanMailAdminPanel.tsx": "Shows fan mail messages, allows replying via dialog, and sorts messages by submission date.",
  "frontend/src/components/admin/panels/GalleryAdminPanel.tsx": "Admin panel for viewing, creating, editing, and deleting gallery items with image upload, metadata handling, and character/clan tagging.",
  "frontend/src/components/admin/panels/NewsAdminPanel.tsx": "Admin interface to list, create, edit, and delete news posts with simple title and content fields.",
  "frontend/src/components/admin/panels/ScriptsAdminPanel.tsx": "Panel for managing scripts, supporting creation, editing, and deletion with permission-aware error handling.",
  "frontend/src/components/admin/panels/SupporterHelpAdminPanel.tsx": "Displays supporter help requests with sorting, previews, and a dialog for viewing request details.",
  "frontend/src/components/admin/panels/TeamAdminPanel.tsx": "Admin-only panel for listing team members and granting or revoking user roles via principal IDs.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity, handling authentication state and retry logic.",
  "frontend/src/components/characters/CharacterCard.tsx": "Displays a character card with animated styling, portrait handling, clan color theming, and character details.",
  "frontend/src/components/characters/CreateCharacterDialog.tsx": "Provides a dialog form for creating a new character, handling validation, metadata encoding, and mutation submission.",
  "frontend/src/components/clans/ClanBadge.tsx": "Renders a small clan badge with accent color styling and optional pulse animation.",
  "frontend/src/components/clans/ClanCard.tsx": "Shows a detailed animated clan card with sigil, badge, description, and hover effects.",
  "frontend/src/components/episodes/EpisodeCard.tsx": "Displays an episode card showing title, number, status, summary, and optional watch button.",
  "frontend/src/components/episodes/EpisodePlayerDialog.tsx": "Dialog for viewing an episode’s video or showing a placeholder alert if unavailable.",
  "frontend/src/components/gallery/ArtistLeaderboard.tsx": "Fetches and displays an artist leaderboard with ranks, badges, loading states, and artist detail dialog support.",
  "frontend/src/components/gallery/ArtistProfileDialog.tsx": "Displays a dialog showing an artist’s stats, badges, and artworks with a lightbox for viewing images. Fetches profile data and handles loading, missing data, and image navigation.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Renders a filterable, category-based gallery grid with optional tabs and clickable items that trigger image selection. Supports responsive layouts and hover effects.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Provides a modal lightbox for viewing gallery images with keyboard navigation, next/previous controls, and optional admin deletion. Handles delete confirmations and wraps images in a dialog.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Implements a dialog for uploading gallery images with drag-and-drop, previews, validation, and metadata fields. Submits new artwork via mutations and supports admin and fan submissions.",
  "frontend/src/components/gallery/HallOfFame.tsx": "Displays curated Hall of Fame entries with featured artwork, achievements, and lightbox viewing. Uses static data and styled cards with hover effects.",
  "frontend/src/components/news/NewPostForm.tsx": "Form for creating news posts with title and content validation, error display, and submit handling. Uses parent-provided submit logic and disables fields during submission.",
  "frontend/src/components/news/NewsPostCard.tsx": "Displays a news post card showing title, author, formatted timestamp, and content.",
  "frontend/src/components/pro/ProModeGate.tsx": "Restricts rendering of children to authenticated admin users and redirects unauthorized users.",
  "frontend/src/components/pro/proPresentationCodec.ts": "Encodes and decodes Pro presentation blocks to and from JSON with basic validation.",
  "frontend/src/components/pro/ProPresentationSection.tsx": "Loads, displays, and edits Pro presentation blocks with animations and Pro-mode editing controls.",
  "frontend/src/components/pro/proPresentationStore.ts": "Zustand store for managing Pro presentation blocks with add, update, remove, and initialization helpers.",
  "frontend/src/components/pro/proPresentationTypes.ts": "Defines TypeScript interfaces for Pro presentation blocks and document structure.",
  "frontend/src/components/pro/ProToolbar.tsx": "Provides controls to add blocks and save Pro presentation changes with mutation handling and toasts.",
  "frontend/src/components/sections/AboutSection.tsx": "Animated section describing story features with icons and scroll-reveal effects.",
  "frontend/src/components/sections/CharactersSection.tsx": "Loads, transforms, and displays character data with admin create controls and scroll animations.",
  "frontend/src/components/sections/ClansSection.tsx": "Fetches and displays elemental clans with styling, fallbacks, animations, and an embedded world map.",
  "frontend/src/components/sections/CollaborationForm.tsx": "A form component for submitting collaboration requests with validation, mutation handling, and success/error states.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays the main contact section with fan mail, contact info, and collaboration/support forms, animated on scroll.",
  "frontend/src/components/sections/DonationSection.tsx": "Renders the donation section with themed visuals and a list of supporter reward tiers.",
  "frontend/src/components/sections/EpisodesSection.tsx": "Loads and displays episodes from the backend, handles errors, and opens a player dialog for released episodes.",
  "frontend/src/components/sections/FanMailForm.tsx": "A fan mail submission form with validation, mutation handling, and success/error feedback.",
  "frontend/src/components/sections/Footer.tsx": "Footer with branding, navigation links, social icons, and scroll-triggered reveal animation.",
  "frontend/src/components/sections/GallerySection.tsx": "Displays gallery items with filtering, sorting, lightbox viewing, and admin upload/delete functionality using backend queries.",
  "frontend/src/components/sections/HeaderNav.tsx": "Renders a responsive navigation bar with scroll effects, smooth section scrolling, mobile menu, and admin link support.",
  "frontend/src/components/sections/HeroSection.tsx": "Defines the animated hero section with parallax background, particle effects, and large title content.",
  "frontend/src/components/sections/NewsUpdatesSection.tsx": "Handles fetching, displaying, and creating news posts with authentication, profile setup, and error handling.",
  "frontend/src/components/sections/SupporterHelpForm.tsx": "Implements a supporter help request form with validation, submission via mutation, and success or error feedback.",
  "frontend/src/components/sections/WorldMapHotspotsOverlay.tsx": "Renders interactive SVG hotspots on a world map, managing refs and keyboard accessibility for location selection.",
  "frontend/src/components/sections/WorldMapLoreDialog.tsx": "Displays a dialog showing detailed lore text for a selected world map location with title, region, and close controls.",
  "frontend/src/components/sections/WorldMapSection.tsx": "Renders the world map with animated reveal, clickable hotspots, and a lore dialog that opens on region selection.",
  "frontend/src/data/characters.ts": "Defines character data including clan, personality, powers, and roles for multiple story characters.",
  "frontend/src/data/clans.ts": "Provides clan definitions with descriptions, colors, glow classes, and sigil image paths.",
  "frontend/src/data/episodes.ts": "Lists Season 1 episodes with titles, summaries, status, and optional media URLs.",
  "frontend/src/data/gallery.ts": "Defines gallery item structure and category list, with an empty initial gallery array.",
  "frontend/src/data/worldMapLocations.ts": "Contains world map location metadata including coordinates, lore text, clan affiliation, and SVG hotspot shapes.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, storing identities, and handling login states using AuthClient.",
  "frontend/src/hooks/useParallax.ts": "Creates a parallax scroll effect on a referenced element with reduced-motion support and performance optimizations.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects whether the user prefers reduced motion via a media query and returns a boolean state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations and lookups across user profiles, news, episodes, and other backend entities using an actor.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Reveals an element when it enters the viewport using IntersectionObserver, respecting reduced-motion preferences.",
  "frontend/src/index.css": "Global Tailwind-based styles defining light/dark theme variables, fonts, animations, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/types/fanArtCommunity.ts": "Type definitions for fan art community data such as artists, artworks, leaderboards, and hall-of-fame entries.",
  "frontend/src/utils/adminContentAdapters.ts": "Encodes and decodes metadata inside text fields for clans, characters, episodes, and gallery items, and provides styling helpers.",
  "frontend/src/utils/galleryImageUpload.ts": "Validates uploaded images for type and size and converts them to data URLs, with separate limits for gallery, episode, and character images.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, custom colors, radii, shadows, and plugins like typography and container queries.",
  "project_state.json": "Describes project state, requirements, and issues for adding Collaboration and Supporter Help form submissions with backend storage and admin viewing."
}