{
  "backend/main.mo": "Main canister actor defining data models and state for profiles, episodes, characters, clans, gallery items, news, scripts, pro blocks, and fan mail, including storage and access-control mixins.",
  "backend/migration.mo": "Migration module converting old gallery item structures into the extended new format with added metadata fields and default values.",
  "feature_evidence.json": "Feature evidence report listing feature requests, affected files, components, and associated tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files, components, hooks, and configuration behavior.",
  "frontend/index.css": "Base Tailwind CSS setup defining color variables, themes, and core styling for light and dark modes.",
  "frontend/index.html": "Minimal HTML root document loading the React application entry point.",
  "frontend/src/App.tsx": "Top-level React app managing hash-based routing between main, admin, and pro views and rendering all major sections accordingly.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Admin gate component handling authentication, admin checks, and routing to either login prompts, unauthorized messages, or the admin dashboard.",
  "frontend/src/components/admin/AdminDashboardView.tsx": "Provides the main admin dashboard UI with navigation tabs for managing site content and routes to various admin panels.",
  "frontend/src/components/admin/panels/CharactersAdminPanel.tsx": "Implements character management including listing, creating, editing, deleting, and metadata encoding/decoding.",
  "frontend/src/components/admin/panels/ClansAdminPanel.tsx": "Handles CRUD operations for clans with metadata encoding and a dialog-based form.",
  "frontend/src/components/admin/panels/EpisodesAdminPanel.tsx": "Manages episodes with CRUD, reordering, file upload handling, character tagging, and visibility settings.",
  "frontend/src/components/admin/panels/FanMailAdminPanel.tsx": "Displays fan mail messages, supports viewing and replying, and sorts messages by newest first.",
  "frontend/src/components/admin/panels/GalleryAdminPanel.tsx": "Admin panel for creating, editing, and deleting gallery items with image upload, metadata handling, and tag selection.",
  "frontend/src/components/admin/panels/NewsAdminPanel.tsx": "Admin interface for managing news posts, supporting creation, editing, deletion, and basic validation.",
  "frontend/src/components/admin/panels/ScriptsAdminPanel.tsx": "Panel for managing script entries with create, update, and delete functionality and permission-aware error handling.",
  "frontend/src/components/admin/panels/TeamAdminPanel.tsx": "Admin tool for listing team members and granting or revoking user roles with permission checks.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with status handling and automatic retry on auth conflicts.",
  "frontend/src/components/characters/CharacterCard.tsx": "UI component displaying a character card with clan-based styling, portrait handling, and motion-aware animations.",
  "frontend/src/components/characters/CreateCharacterDialog.tsx": "Dialog form for creating a character, handling validation, metadata encoding, and mutation submission.",
  "frontend/src/components/clans/ClanBadge.tsx": "Displays a small styled badge for a clan with animated accent effects.",
  "frontend/src/components/clans/ClanCard.tsx": "Animated card showing clan details, sigil, badge, and description with motion‑aware effects.",
  "frontend/src/components/episodes/EpisodeCard.tsx": "Card displaying episode metadata and optional watch button, styled by release status.",
  "frontend/src/components/episodes/EpisodePlayerDialog.tsx": "Dialog for viewing an episode with video playback or an unavailable notice.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Grid of gallery items with category filtering and interactive hover previews.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Lightbox dialog for viewing gallery images with navigation and keyboard controls.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Dialog for uploading gallery images with drag‑and‑drop, metadata fields, and create mutation.",
  "frontend/src/components/news/NewPostForm.tsx": "Form component for creating a news post with validation and submit handling.",
  "frontend/src/components/news/NewsPostCard.tsx": "Displays a news post with formatted timestamp, author, title, and content.",
  "frontend/src/components/pro/ProModeGate.tsx": "Gatekeeper component that renders children only for authenticated admin users.",
  "frontend/src/components/pro/proPresentationCodec.ts": "Encodes and decodes Pro presentation blocks to and from JSON with validation.",
  "frontend/src/components/pro/ProPresentationSection.tsx": "Loads, displays, and optionally edits Pro presentation blocks with scroll animations.",
  "frontend/src/components/pro/proPresentationStore.ts": "Zustand store managing Pro presentation blocks and basic CRUD operations.",
  "frontend/src/components/pro/proPresentationTypes.ts": "Type definitions for Pro presentation blocks and documents.",
  "frontend/src/components/pro/ProToolbar.tsx": "Floating toolbar for adding blocks and saving Pro presentation changes.",
  "frontend/src/components/sections/AboutSection.tsx": "Animated About section showcasing story features with icons and scroll reveal effects.",
  "frontend/src/components/sections/CharactersSection.tsx": "Fetches, transforms, and displays character cards with admin creation controls.",
  "frontend/src/components/sections/ClansSection.tsx": "Displays a clans section that loads clan data, falls back to static data, and renders ClanCards with scroll-based animations and a world map.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders the contact section with a fan mail form, contact info, and scroll-triggered animations.",
  "frontend/src/components/sections/DonationSection.tsx": "Shows donation tiers and descriptions with animated visuals and a styled background.",
  "frontend/src/components/sections/EpisodesSection.tsx": "Fetches and displays episodes with loading/error states, supports watching released episodes, and opens an episode player dialog.",
  "frontend/src/components/sections/FanMailForm.tsx": "Provides a fan mail form with validation, success/error handling, and submission via a mutation hook.",
  "frontend/src/components/sections/Footer.tsx": "Renders the footer with branding, navigation links, social icons, and scroll-triggered animation.",
  "frontend/src/components/sections/GallerySection.tsx": "Renders the gallery with filters, sorting, admin uploads, and lightbox functionality using backend queries and metadata decoding.",
  "frontend/src/components/sections/HeaderNav.tsx": "Provides a responsive navigation bar with smooth scrolling, admin access, and mobile menu handling.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the animated hero section with parallax background, particle effects, and title content respecting motion preferences.",
  "frontend/src/components/sections/NewsUpdatesSection.tsx": "Shows news posts, login handling, admin post creation, and user profile setup with modal support.",
  "frontend/src/components/sections/WorldMapHotspotsOverlay.tsx": "Renders interactive SVG hotspots for the world map, managing refs and keyboard accessibility for location selection.",
  "frontend/src/components/sections/WorldMapLoreDialog.tsx": "Displays a dialog containing lore details for a selected map location with close controls.",
  "frontend/src/components/sections/WorldMapSection.tsx": "React section component showing the world map with animated reveal, hotspot interactions, and a lore dialog.",
  "frontend/src/data/characters.ts": "Defines character types and a list of detailed character profiles with clan, personality, powers, and roles.",
  "frontend/src/data/clans.ts": "Defines clan metadata including descriptions, colors, and sigil asset paths.",
  "frontend/src/data/episodes.ts": "Defines the Episode type and a list of Season 1 episodes with titles, summaries, and release status.",
  "frontend/src/data/gallery.ts": "Defines gallery item structure, provides an empty items array, and lists available gallery categories.",
  "frontend/src/data/worldMapLocations.ts": "Defines world map location data with coordinates, lore text, clan association, and SVG hotspot shapes.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider handling login, identity storage, and auth client setup.",
  "frontend/src/hooks/useParallax.ts": "React hook applying scroll-based parallax transforms with reduced‑motion support.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook detecting the user's prefers‑reduced‑motion media setting and updates on change.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user data, roles, episodes, and other backend entities.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Hook that reveals an element when it enters the viewport using IntersectionObserver with reduced‑motion fallback.",
  "frontend/src/index.css": "Tailwind base and utility styles with custom color variables and anime‑themed glow animations.",
  "frontend/src/main.tsx": "Entry point mounting the app with React Query and Internet Identity providers.",
  "frontend/src/utils/adminContentAdapters.ts": "Utilities to encode and decode metadata in content fields for clans, characters, episodes, and gallery items.",
  "frontend/src/utils/galleryImageUpload.ts": "Image upload validator converting files to data URLs with type and size checks.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended OKLCH-based color system, custom radii, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, goals, architecture notes, known issues, and existing features for the anime-themed website and admin system."
}