{
  "backend/main.mo": "Defines the main backend actor with storage mixins, access control state, and typed data models for episodes, characters, clans, gallery items, news posts, scripts, pro blocks, fan mail, collaborations, and support requests.",
  "feature_evidence.json": "Lists feature evidence entries mapping new features to the frontend files, components, and test IDs that implement or support them.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and functionality of various frontend files across components, hooks, and configuration.",
  "frontend/index.css": "Defines global Tailwind-based CSS variables and theme layers for light and dark modes, setting color tokens and base styling.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx as the module bundle.",
  "frontend/src/App.tsx": "Main React application component managing hash-based routing between main, admin, pro, and secret views and rendering all major site sections accordingly.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Admin gate component handling Internet Identity auth, admin checks, loading states, unauthorized messaging, and principal ID copy support.",
  "frontend/src/components/admin/AdminDashboardView.tsx": "Renders the admin dashboard with tab navigation linking to all admin management panels.",
  "frontend/src/components/admin/panels/CharactersAdminPanel.tsx": "Provides CRUD management for characters, including metadata encoding and form dialogs.",
  "frontend/src/components/admin/panels/ClansAdminPanel.tsx": "Enables creating, editing, and deleting clans with encoded metadata fields.",
  "frontend/src/components/admin/panels/CollaborationAdminPanel.tsx": "Displays and inspects collaboration requests sorted by timestamp using a scrollable list and detail dialog.",
  "frontend/src/components/admin/panels/EpisodesAdminPanel.tsx": "Handles full episode management including creation, editing, reordering, tagging characters, and thumbnail uploads.",
  "frontend/src/components/admin/panels/FanMailAdminPanel.tsx": "Lists fan mail messages and supports replying via a dialog with preview and success feedback.",
  "frontend/src/components/admin/panels/GalleryAdminPanel.tsx": "Admin UI for creating, editing, and deleting gallery items with image upload, metadata handling, and character/clan tagging.",
  "frontend/src/components/admin/panels/NewsAdminPanel.tsx": "Admin panel to list, create, edit, and delete news posts with simple title and content management.",
  "frontend/src/components/admin/panels/ScriptsAdminPanel.tsx": "Interface for managing scripts, including CRUD operations with creator validation and error handling for permissions.",
  "frontend/src/components/admin/panels/SupporterHelpAdminPanel.tsx": "Displays supporter help requests with sorting, previews, and a dialog to view request details.",
  "frontend/src/components/admin/panels/TeamAdminPanel.tsx": "Allows admins to view team members and grant or revoke user roles using principal IDs.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with status handling and query cache reset.",
  "frontend/src/components/characters/CharacterCard.tsx": "Displays an animated character card with portrait, clan styling, and character details, handling image errors and motion preferences.",
  "frontend/src/components/characters/CreateCharacterDialog.tsx": "Provides a dialog form for creating a new character, validating inputs, encoding metadata, and submitting via mutation.",
  "frontend/src/components/clans/ClanBadge.tsx": "Renders a small animated badge showing a clan’s name and accent color.",
  "frontend/src/components/clans/ClanCard.tsx": "Displays a detailed, animated clan card with sigil, badge, and description, styled by clan accent colors.",
  "frontend/src/components/episodes/EpisodeCard.tsx": "Shows a compact episode preview with number, title, summary, status badge, and optional watch button.",
  "frontend/src/components/episodes/EpisodePlayerDialog.tsx": "Provides a dialog for viewing an episode with embedded video playback or a fallback alert when unavailable.",
  "frontend/src/components/gallery/ArtistLeaderboard.tsx": "Displays a ranked artist leaderboard with badges, loading states, and an optional artist profile dialog trigger.",
  "frontend/src/components/gallery/ArtistProfileDialog.tsx": "Displays an artist’s profile with stats, badges, and artwork grid, with lightbox support for viewing images. Fetches profile data and handles loading and missing states.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Renders a responsive gallery with category filtering tabs and image click handling. Supports dynamic category availability based on provided items.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Provides a modal lightbox for viewing gallery items with navigation, keyboard controls, and optional admin delete actions. Manages image transitions and delete confirmation.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Implements a full upload form for gallery items with drag‑and‑drop, image validation, metadata fields, and admin/submit logic. Handles image processing, form validation, and submission states.",
  "frontend/src/components/gallery/HallOfFame.tsx": "Displays static Hall of Fame artist entries with featured artwork and achievements. Includes lightbox support for viewing highlighted images.",
  "frontend/src/components/news/NewPostForm.tsx": "Form for creating news posts with title/content fields, validation, error display, and submission handling. Clears fields on success and disables input during submit.",
  "frontend/src/components/news/NewsPostCard.tsx": "Displays a formatted news post with date, author, title, and content.",
  "frontend/src/components/pro/ProModeGate.tsx": "Restricts access to Pro mode components by checking authentication and admin status.",
  "frontend/src/components/pro/proPresentationCodec.ts": "Encodes and decodes Pro presentation blocks to and from JSON with basic validation.",
  "frontend/src/components/pro/ProPresentationSection.tsx": "Manages and displays Pro presentation blocks, allowing editing in Pro mode and loading stored data.",
  "frontend/src/components/pro/proPresentationStore.ts": "Zustand store managing Pro presentation blocks with actions to add, update, remove, and initialize.",
  "frontend/src/components/pro/proPresentationTypes.ts": "Defines TypeScript interfaces for Pro presentation blocks and documents.",
  "frontend/src/components/pro/ProToolbar.tsx": "Provides controls to add blocks and save Pro presentation changes, handling mutations and navigation.",
  "frontend/src/components/quiz/quizScoring.ts": "Initializes clan scores and determines the quiz result based on scoring rules and tie logic.",
  "frontend/src/components/quiz/ResultsCard.tsx": "Renders quiz results with clan visuals, personality text, and styling based on clan data.",
  "frontend/src/components/quiz/shareUtils.ts": "Provides utilities to copy quiz results to clipboard and a stub for downloading results as images.",
  "frontend/src/components/secrets/secretProgress.ts": "Manages persistent secret discovery progress using localStorage with helpers to update and query state.",
  "frontend/src/components/secrets/SecretVaultSection.tsx": "Displays secret vault progress, lore fragments, characters, and artwork with selection dialogs.",
  "frontend/src/components/sections/AboutSection.tsx": "Animated story introduction section with scroll reveal and feature cards describing battles, lore, and elemental powers.",
  "frontend/src/components/sections/CharactersSection.tsx": "Loads and displays character cards with admin create controls, handling loading, errors, and scroll animations.",
  "frontend/src/components/sections/ClanPersonalityQuizSection.tsx": "Interactive multi-step clan personality quiz with scoring, results display, sharing, and animated reveal effects.",
  "frontend/src/components/sections/ClansSection.tsx": "Fetches and displays clan cards using metadata and fallback data, with dramatic visuals and an embedded world map section.",
  "frontend/src/components/sections/CollaborationForm.tsx": "Form for submitting collaboration requests with validation, mutation handling, success feedback, and error alerts.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact page section with animated reveal, fan mail form, collaboration form, and static contact info details.",
  "frontend/src/components/sections/DonationSection.tsx": "Animated donation section displaying themed supporter tiers and benefits with styled backgrounds and scroll‑reveal effects.",
  "frontend/src/components/sections/EpisodesSection.tsx": "Loads and displays episodes with metadata decoding, handles loading/error states, and opens a video player dialog for released episodes.",
  "frontend/src/components/sections/FanMailForm.tsx": "Fan mail submission form with validation, success/error handling, and backend mutation integration.",
  "frontend/src/components/sections/Footer.tsx": "Footer with brand info, quick‑link scroll navigation, social links, and scroll‑reveal animation.",
  "frontend/src/components/sections/GallerySection.tsx": "Comprehensive gallery system with filtering, sorting, admin actions, lightbox viewing, uploads, and metadata decoding.",
  "frontend/src/components/sections/HeaderNav.tsx": "Responsive navigation bar with scroll detection, section scrolling, mobile menu handling, and admin access link.",
  "frontend/src/components/sections/HeroSection.tsx": "Animated hero section with particle effects, parallax background, and stylized title content, respecting reduced‑motion preferences.",
  "frontend/src/components/sections/NewsUpdatesSection.tsx": "Displays news posts with authentication, profile setup, admin post creation, and scroll‑reveal animations.",
  "frontend/src/components/sections/PowerSystemDatabaseSection.tsx": "Interactive power‑system browser with tabs, search filtering, and animated reveal for types, rules, forbidden techniques, and characters.",
  "frontend/src/components/sections/SupporterHelpForm.tsx": "Support request form with validation, submission handling, error display, and success feedback.",
  "frontend/src/components/sections/WorldMapHotspotsOverlay.tsx": "SVG overlay rendering interactive world‑map hotspots with keyboard support, glow effects, and reduced‑motion handling.",
  "frontend/src/components/sections/WorldMapLoreDialog.tsx": "Dialog showing lore for a selected map location and triggering secret‑unlock events for specific areas.",
  "frontend/src/components/sections/WorldMapSection.tsx": "Renders the world map section with scroll-triggered animations, clickable region hotspots, and a lore dialog. Manages focus, selected regions, and reduced-motion behavior.",
  "frontend/src/data/characters.ts": "Defines Character data and exports a list of characters with clan, personality, powers, and roles. Used for character profiles across the app.",
  "frontend/src/data/clanQuizQuestions.ts": "Provides quiz questions and weighted answers used to calculate clan alignment. Defines question and answer interfaces.",
  "frontend/src/data/clanQuizResults.ts": "Contains clan result definitions with personality descriptions and optional secret clan flag. Used to interpret quiz outcomes.",
  "frontend/src/data/clans.ts": "Defines clans with descriptions, styling info, and sigil paths. Supplies metadata for clan displays and theming.",
  "frontend/src/data/episodes.ts": "Lists Season 1 episodes with titles, summaries, release status, and media fields. Supports episode display and progression.",
  "frontend/src/data/gallery.ts": "Defines gallery item structure and category list, with an empty initial gallery array. Supports media gallery features.",
  "frontend/src/data/powerSystemDatabase.ts": "Defines power types, ability rules, forbidden techniques, and character abilities. Serves as the database for the series' power system.",
  "frontend/src/data/secretLore.ts": "Defines interfaces and arrays for lore fragments, hidden character info, and bonus artwork metadata.",
  "frontend/src/data/worldMapLocations.ts": "Provides the WorldMapLocation interface and a list of map locations with coordinates, lore text, and SVG shapes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useParallax.ts": "Hook that applies a scroll-based parallax transform to an element unless reduced motion is preferred.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and tracks the user's prefers-reduced-motion setting.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including profiles, admin checks, news, episodes, and more.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Hook that reveals an element when it enters the viewport using IntersectionObserver, respecting reduced motion.",
  "frontend/src/index.css": "Defines global Tailwind layers, OKLCH color variables for light/dark themes, font settings, and custom glow utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, importing global styles.",
  "frontend/src/types/fanArtCommunity.ts": "Provides TypeScript interfaces for artist leaderboards, hall of fame entries, profiles, and artworks.",
  "frontend/src/utils/adminContentAdapters.ts": "Contains helpers to encode/decode metadata for clans, characters, episodes, and gallery items, plus default clan styling lookup.",
  "frontend/src/utils/galleryImageUpload.ts": "Validates image uploads by type and size and converts valid files to data URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, OKLCH-based colors, utilities, plugins, and responsive container settings.",
  "project_state.json": "Describes the project state, feature requirements, known issues, and required artwork assets."
}