{
  "backend/main.mo": "Main canister actor managing access control, user profiles, and CRUD lists for episodes, characters, clans, gallery items, news posts, and scripts.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend components, hooks, and configuration files.",
  "frontend/index.css": "Tailwind base stylesheet defining color variables, dark mode values, and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component using hash-based routing to display either the main site or the admin dashboard.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Gatekeeper component that checks Internet Identity authentication and admin status before showing the admin dashboard.",
  "frontend/src/components/admin/AdminDashboardView.tsx": "Admin dashboard layout with tabbed panels for managing all content types, plus navigation back to the main site.",
  "frontend/src/components/admin/panels/CharactersAdminPanel.tsx": "Admin interface for listing, creating, editing, and deleting characters with metadata encoding and validation.",
  "frontend/src/components/admin/panels/ClansAdminPanel.tsx": "Admin panel for listing, creating, editing, and deleting clans, including metadata encoding and form dialogs.",
  "frontend/src/components/admin/panels/EpisodesAdminPanel.tsx": "Admin interface to manage episodes with create/edit forms, metadata encoding, and deletion handling.",
  "frontend/src/components/admin/panels/GalleryAdminPanel.tsx": "Admin panel for managing gallery items with image upload/validation, metadata handling, and CRUD dialogs.",
  "frontend/src/components/admin/panels/NewsAdminPanel.tsx": "Simple admin panel for creating, editing, and deleting news posts using a basic title/content form.",
  "frontend/src/components/admin/panels/ScriptsAdminPanel.tsx": "Panel for managing script entries with create/edit workflows, permission-aware error handling, and CRUD support.",
  "frontend/src/components/admin/panels/TeamAdminPanel.tsx": "Admin panel for listing team members, granting or revoking roles, and adding new principals with error handling. Shows restricted access messages and loading states.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and retry logic. Clears query cache on logout.",
  "frontend/src/components/characters/CharacterCard.tsx": "Displays a character with animated styling, clan-based colors, and details like personality, power, and role. Supports reduced-motion preferences and staggered animations.",
  "frontend/src/components/clans/ClanBadge.tsx": "Renders a styled badge for a clan with pulse animation and accent-based colors. Adjusts animations based on motion preferences.",
  "frontend/src/components/clans/ClanCard.tsx": "Shows a detailed clan card with animations, glow effects, sigil image, and description. Uses motion preferences for animation behavior.",
  "frontend/src/components/episodes/EpisodeCard.tsx": "Displays an episode summary with release status, number, and optional watch button. Highlights released episodes with color cues.",
  "frontend/src/components/episodes/EpisodePlayerDialog.tsx": "Modal dialog that plays an episode’s video or shows an unavailable alert. Includes metadata like title, number, and summary.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Image gallery with category filtering and responsive grid layout. Handles tabs, category selection, and image click callbacks.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "No summary available.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Upload dialog allowing admins to drag, drop, validate, preview, and submit new gallery images with metadata.",
  "frontend/src/components/news/NewPostForm.tsx": "Form for creating a new news post with validation, error display, and submission handling.",
  "frontend/src/components/news/NewsPostCard.tsx": "Card component that displays a news post’s title, author, formatted timestamp, and content.",
  "frontend/src/components/sections/AboutSection.tsx": "Animated section presenting series lore highlights with feature cards revealed on scroll.",
  "frontend/src/components/sections/CharactersSection.tsx": "Character listing section that loads characters from the backend, decodes metadata, and renders cards with loading/error states.",
  "frontend/src/components/sections/ClansSection.tsx": "Clan showcase section that loads clan data, merges metadata with static styling, and displays animated clan cards with fallbacks.",
  "frontend/src/components/sections/EpisodesSection.tsx": "Fetches, transforms, and displays a list of episodes with watch handling and a player dialog.",
  "frontend/src/components/sections/Footer.tsx": "Renders the site footer with brand info, quick navigation links, social icons, and scroll‑reveal animation.",
  "frontend/src/components/sections/GallerySection.tsx": "Loads and displays gallery items with lightbox navigation and optional admin upload controls.",
  "frontend/src/components/sections/HeaderNav.tsx": "Provides a responsive navigation bar with scroll effects, section scrolling, mobile menu, and admin link.",
  "frontend/src/components/sections/HeroSection.tsx": "Creates an animated hero banner with particles, parallax background, and title content.",
  "frontend/src/components/sections/NewsUpdatesSection.tsx": "Manages news posts, profile setup, and admin posting with loading states and sorted display.",
  "frontend/src/data/characters.ts": "Defines the Character interface and a list of character data including traits, powers, and roles.",
  "frontend/src/data/clans.ts": "Defines the Clan interface and a set of clan descriptions with styling metadata.",
  "frontend/src/data/episodes.ts": "Provides the Episode interface and Season 1 episode list with status and summaries.",
  "frontend/src/data/gallery.ts": "Defines gallery item structure and exports a small set of gallery entries and categories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context for login, identity persistence, and status tracking.",
  "frontend/src/hooks/useParallax.ts": "Hook that applies scroll-based parallax transforms to a referenced element.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects system reduced-motion preference and updates state on changes.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks wrapping backend calls for profiles, roles, episodes, and other entities.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Hook providing intersection-based reveal-on-scroll behavior with reduced-motion handling.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables, glow utilities, gradients, and animation utilities for the site's dramatic aesthetic.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/adminContentAdapters.ts": "Provides encode/decode helpers for storing metadata in content fields and retrieves fallback clan styling.",
  "frontend/src/utils/galleryImageUpload.ts": "Validates image uploads for MIME type and size, converting valid files to data URLs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL params, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, glow shadows, containers, and plugin integrations.",
  "project_state.json": "Stores project metadata, design goals, architecture notes, known issues, and tracked features for the site."
}