{
  "backend/main.mo": "Motoko canister managing users, episodes, characters, clans, gallery items, news posts, and scripts with access control and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping episode‑related frontend features to the files implementing them.",
  "frontend-file-summaries.txt": "Collection of textual summaries describing purpose and behavior of various frontend components, hooks, and config files.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme variables, dark mode tokens, and base element styles.",
  "frontend/index.html": "Basic HTML entry file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that switches between the main site and admin dashboard using hash-based routing.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Gatekeeper component that checks identity and admin status to show login, unauthorized message, or the admin dashboard.",
  "frontend/src/components/admin/AdminDashboardView.tsx": "Admin dashboard layout with tabbed panels for managing episodes, characters, clans, gallery, news, scripts, and team content.",
  "frontend/src/components/admin/panels/CharactersAdminPanel.tsx": "Admin panel for listing, creating, editing, and deleting characters with metadata encoding and form dialogs.",
  "frontend/src/components/admin/panels/ClansAdminPanel.tsx": "Admin UI to manage clans, including creation, editing, deletion, and metadata handling for descriptions.",
  "frontend/src/components/admin/panels/EpisodesAdminPanel.tsx": "Panel for CRUD operations on episodes, supporting metadata for number/status and media fields.",
  "frontend/src/components/admin/panels/GalleryAdminPanel.tsx": "Admin interface for managing gallery items with image upload, preview, metadata, and CRUD dialogs.",
  "frontend/src/components/admin/panels/NewsAdminPanel.tsx": "Simple admin panel for creating, editing, and deleting news posts with title and content fields.",
  "frontend/src/components/admin/panels/ScriptsAdminPanel.tsx": "Admin panel to list, create, edit, and delete scripts using form dialogs and mutation hooks.",
  "frontend/src/components/admin/panels/TeamAdminPanel.tsx": "Admin panel for managing team members, granting and revoking roles, with permission checks and dialogs.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading state and automatic error recovery.",
  "frontend/src/components/characters/CharacterCard.tsx": "Displays a character card with animated styling, clan‑based colors, and personality/power/role details.",
  "frontend/src/components/clans/ClanBadge.tsx": "Renders a small animated badge showing a clan’s name and accent color.",
  "frontend/src/components/clans/ClanCard.tsx": "Visual clan card with animations, sigil image, badge, and description.",
  "frontend/src/components/episodes/EpisodeCard.tsx": "Episode preview card showing title, number, status, summary, and optional watch button.",
  "frontend/src/components/episodes/EpisodePlayerDialog.tsx": "Dialog that displays an episode’s video player or a missing‑video alert.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Renders a filterable gallery grid with category tabs and image click handling.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Provides a fullscreen lightbox with navigation, keyboard controls, and image details.",
  "frontend/src/components/gallery/GalleryUploadDialog.tsx": "Implements an image upload dialog with drag‑and‑drop, validation, metadata encoding, and submit handling.",
  "frontend/src/components/news/NewPostForm.tsx": "Form for creating news posts with validation, error display, and submit handling.",
  "frontend/src/components/news/NewsPostCard.tsx": "Displays a single news post with formatted timestamp, author, and content.",
  "frontend/src/components/sections/AboutSection.tsx": "Animated about section showcasing key features with icons and scroll‑reveal effects.",
  "frontend/src/components/sections/CharactersSection.tsx": "Loads and displays character cards with metadata decoding, loading states, and scroll animation.",
  "frontend/src/components/sections/ClansSection.tsx": "Displays animated clan cards, loading backend clans when available and falling back to static data with styling metadata.",
  "frontend/src/components/sections/EpisodesSection.tsx": "Renders a scroll-revealed episode list with backend-loaded metadata, watch handling, and an episode player dialog.",
  "frontend/src/components/sections/Footer.tsx": "Provides a scroll-revealed footer with branding, quick navigation, and social links, with motion reductions respected.",
  "frontend/src/components/sections/GallerySection.tsx": "Shows a gallery grid with backend metadata, lightbox navigation, and an admin upload option with scroll-triggered animation.",
  "frontend/src/components/sections/HeaderNav.tsx": "Implements a responsive header with scroll effects, section navigation, mobile menu, and optional admin access.",
  "frontend/src/components/sections/HeroSection.tsx": "Creates an animated parallax hero section with particles, layered backgrounds, and stylized title content.",
  "frontend/src/components/sections/NewsUpdatesSection.tsx": "Renders the news section with post listing, profile setup, and admin post creation logic using multiple hooks and UI components.",
  "frontend/src/data/characters.ts": "Defines the Character interface and exports a list of detailed character profiles with clans, abilities, and roles.",
  "frontend/src/data/clans.ts": "Defines the Clan interface and exports metadata for each clan including descriptions, colors, and sigil paths.",
  "frontend/src/data/episodes.ts": "Defines Episode structure and provides the Season 1 episode list with summaries and release status.",
  "frontend/src/data/gallery.ts": "Defines gallery item types and exports a small set of gallery entries and category names.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refetches dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, stored identities, and status tracking.",
  "frontend/src/hooks/useParallax.ts": "Implements a parallax scrolling hook that applies transform effects unless reduced motion is preferred.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced‑motion preference using a media query and updates on changes.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, roles, episodes, characters, and related backend data via an actor.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Implements an intersection‑observer hook to reveal elements on scroll, respecting reduced‑motion preferences.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom utilities including glow effects, gradients, and cinematic animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/utils/adminContentAdapters.ts": "Provides helpers to encode/decode metadata into text fields for clans, characters, episodes, and gallery items, plus styling lookup.",
  "frontend/src/utils/galleryImageUpload.ts": "Validates image uploads for type and size and converts valid files to data URLs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, container settings, shadows, and other theme utilities with custom clan and UI tokens.",
  "project_state.json": "Stores the project's versioned state, including the overall site vision, architectural notes, known issues, and a list of existing implemented features. Acts as a central reference for design direction, structure, and current progress."
}