{
  "kind": "build_request",
  "title": "Add Collaboration & Supporter Help submission forms with admin viewing",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a Collaboration contact form to the Contact page that allows any visitor to type and submit: Name, Email, Optional Social Media Links, and a Message.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "in the collaberation contact tab and the Supporter Help contact tab, allow all people to be able to type stuff using Name\nYour Name\nEmail\nyour.email@example.com\nOptional Social Media Links\nTwitter, Instagram, Discord, etc.",
          "yes....let them submit and alow admins to see it in the admin panel",
          "1"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/components/sections/ContactSection.tsx`, the existing static “Collaboration” card includes an interactive form (not just display text).",
        "The Collaboration form includes inputs for Name, Email, Optional Social Media Links, and a multiline Message field, plus a Submit button.",
        "Form validation prevents submitting when required fields are missing (at minimum: Name and Message, consistent with `FanMailForm`).",
        "On successful submit, the form resets and a success alert is shown; on failure, an error alert is shown.",
        "Form is usable for unauthenticated visitors (no Internet Identity login required)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a Supporter Help contact form to the Contact page that allows any visitor to type and submit: Name, Email, Optional Social Media Links, and a Message.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "in the collaberation contact tab and the Supporter Help contact tab, allow all people to be able to type stuff using Name\nYour Name\nEmail\nyour.email@example.com\nOptional Social Media Links\nTwitter, Instagram, Discord, etc.",
          "yes....let them submit and alow admins to see it in the admin panel",
          "1"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/components/sections/ContactSection.tsx`, the existing static “Supporter Help” card includes an interactive form (not just instructions text).",
        "The Supporter Help form includes inputs for Name, Email, Optional Social Media Links, and a multiline Message field, plus a Submit button.",
        "Form validation prevents submitting when required fields are missing (at minimum: Name and Message, consistent with `FanMailForm`).",
        "On successful submit, the form resets and a success alert is shown; on failure, an error alert is shown.",
        "The existing destructive warning (“ONLY for supporters…”) remains visible above the form."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement backend storage and APIs for Collaboration form submissions, including an admin-only method to list all submissions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "let them submit and alow admins to see it in the admin panel"
        ]
      },
      "acceptanceCriteria": [
        "In `backend/main.mo`, define a new public type for Collaboration submissions that stores: id, senderName, senderEmail, socialLinks, message, and submittedAt timestamp.",
        "In `backend/main.mo`, store Collaboration submissions in backend state with an auto-incrementing id (pattern consistent with existing `fanMails` + `nextFanMailId`).",
        "Expose a public shared method for any visitor to submit a Collaboration entry (no admin restriction).",
        "Expose a public query method to retrieve all Collaboration submissions that is restricted to admins (trap with an Unauthorized message for non-admins).",
        "Returned list is stable in ordering or explicitly sorted on the frontend (either is acceptable, but must be consistent and documented in code)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement backend storage and APIs for Supporter Help form submissions, including an admin-only method to list all submissions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "let them submit and alow admins to see it in the admin panel"
        ]
      },
      "acceptanceCriteria": [
        "In `backend/main.mo`, define a new public type for Supporter Help submissions that stores: id, senderName, senderEmail, socialLinks, message, and submittedAt timestamp.",
        "In `backend/main.mo`, store Supporter Help submissions in backend state with an auto-incrementing id.",
        "Expose a public shared method for any visitor to submit a Supporter Help entry (no admin restriction).",
        "Expose a public query method to retrieve all Supporter Help submissions that is restricted to admins (trap with an Unauthorized message for non-admins)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add React Query hooks for submitting and admin-fetching Collaboration and Supporter Help submissions, wired to the new backend actor methods.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "let them submit and alow admins to see it in the admin panel"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/hooks/useQueries.ts`, add mutations for submitting Collaboration and Supporter Help forms.",
        "In `frontend/src/hooks/useQueries.ts`, add admin queries for fetching all Collaboration submissions and all Supporter Help submissions.",
        "Hooks follow the existing patterns used by `useSubmitFanMail` and `useGetAllFanMail` (React Query keys, actor availability checks, invalidation if needed).",
        "All hooks use English user-facing error messaging consistent with existing UI (e.g., “Failed to send…”)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add admin dashboard tabs/panels so admins can view Collaboration and Supporter Help submissions in the admin panel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "alow admins to see it in the admin panel"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/components/admin/AdminDashboardView.tsx`, add new TabsTrigger entries for Collaboration and Supporter Help (alongside existing Fan Mail tab).",
        "Create new admin panels (new files under `frontend/src/components/admin/panels/`) to list Collaboration submissions and Supporter Help submissions.",
        "Each panel shows a count of submissions and a scrollable list similar to `FanMailAdminPanel` (read-only is sufficient).",
        "Clicking an item opens a dialog (or equivalent detail view) showing submitted Name, Email, Optional Social Media Links, Message, and submitted date/time.",
        "Panels display loading skeletons and an error alert if the query fails, consistent with `FanMailAdminPanel`."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or `frontend/src/components/ui` (compose existing UI components instead).",
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Use English for all user-facing text added or changed."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers; only Internet Identity remains supported for admin access.",
    "Do not implement outbound email, SMS, push notifications, or external integrations for contacting users.",
    "Do not add admin reply functionality for Collaboration or Supporter Help unless explicitly requested later."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}