{
  "kind": "build_request",
  "title": "Add Donation tab/section with Cash App instructions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-100",
      "text": "Add a new public-facing page section with stable DOM id \"donation\" that displays the donation/support content for \"Whispers Of The White Moon\" using the exact English text provided by the user (including the Cash App handle \"$WOTWM\"). The section must match the site’s existing cinematic dark styling, include a prominent section title \"Donation\", and use the existing reveal-on-scroll / reduced-motion-safe animation behavior used in other sections.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "make a donation tab \n\n🌙 Support Whispers Of The White Moon\n\nHelp bring the story, animation, and characters to life.\nEvery donation helps support development, voice acting, art, and future episodes.\n\n🔥 Donate Via Cash App\n\n💵 Send support to:\n$WOTWM"
        ]
      },
      "acceptanceCriteria": [
        "A new section is rendered on the public site with id=\"donation\".",
        "The section shows a visible heading/title: \"Donation\".",
        "The donation body content matches the user-provided text verbatim (including \"$WOTWM\").",
        "The section styling is consistent with existing sections (dark cinematic background, readable typography, spacing).",
        "Animations respect prefers-reduced-motion (no mandatory motion effects when reduced motion is enabled)."
      ]
    },
    {
      "id": "REQ-101",
      "text": "Update the site’s primary navigation (HeaderNav) to include a new clickable item labeled \"Donation\" that smooth-scrolls to the \"#donation\" section in both desktop and mobile menus, without breaking existing scroll targets.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "make a donation tab"
        ]
      },
      "acceptanceCriteria": [
        "Header navigation includes a \"Donation\" item on desktop.",
        "Mobile menu includes a \"Donation\" item.",
        "Clicking \"Donation\" smoothly scrolls to the section with id=\"donation\".",
        "All existing nav items (Story, Characters, Clans, Episodes, Gallery, News) still work and scroll correctly."
      ]
    },
    {
      "id": "REQ-102",
      "text": "Insert the new Donation section into the main site page flow in frontend/src/App.tsx so it appears as part of the public homepage content (and also in Pro mode, since Pro mode renders the normal public site UI). Place it in a sensible location near the end of the page (e.g., before the Footer), while preserving existing section order and behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ]
      },
      "acceptanceCriteria": [
        "Donation section renders in the normal (non-admin) view.",
        "Donation section renders in Pro mode view as well.",
        "No existing sections disappear or lose their current ids/scroll behavior after inserting the Donation section."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only Shadcn components).",
    "Do not edit immutable hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Do not add any backend changes for donations; this is a static informational section only.",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Do not implement payment processing, checkout, or any third-party donation API integrations.",
    "Do not store donation data or donor information on the backend.",
    "Do not add authentication requirements for viewing the Donation section."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}