{
  "kind": "build_request",
  "title": "Add glassmorphism glowing card panels for text sections",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a reusable “glowing glass card panel” style (glass effect) that matches the requested card design: slight transparency, soft glowing border, rounded corners, and subtle shadow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create glowing card panels for text sections.\n\nCard Design:\n• Slight transparency (glass effect)\n• Soft glowing border\n• Rounded corners\n• Subtle shadow"
        ]
      },
      "acceptanceCriteria": [
        "A reusable styling API exists (e.g., a shared class and/or wrapper component) that can be applied consistently to multiple text panels/cards.",
        "The panel surface is visibly semi-transparent with a backdrop blur (glass effect).",
        "The panel has rounded corners and a subtle shadow at rest.",
        "The panel shows a soft glowing border (not a hard solid outline) that is visible on both light and dark themes.",
        "The style respects existing Tailwind tokens (e.g., card/background/border/primary/accent) so it stays consistent with the site theme."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply the new glowing glass card panel style to text-focused sections and cards across the main site (at minimum: About section feature cards, News post cards, and the News “Create New Post” form), replacing any one-off card styling so these panels share the same glass/glow look.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create glowing card panels for text sections."
        ]
      },
      "acceptanceCriteria": [
        "About section feature cards use the new glowing glass panel style while keeping their existing layout and animations.",
        "NewsPostCard uses the new glowing glass panel style (including transparency, glow border, rounded corners, shadow).",
        "NewPostForm uses the new glowing glass panel style (including transparency, glow border, rounded corners, shadow).",
        "No user-facing copy is changed as part of applying the new styling.",
        "Visual changes are limited to presentation (no changes to backend data flow or feature behavior)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components); compose them instead.",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx.",
    "Backend remains single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Adding new content sections or new app features beyond the card panel styling.",
    "Changing authentication, admin/pro/secret routing behavior, or backend schemas.",
    "Implementing new animations beyond what is needed for the card’s glow/glass styling."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}