{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Glassmorphism glowing card panel styling and rollout",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a reusable glowing glass panel styling API (glass + glow + rounded + shadow) aligned with Tailwind theme tokens.",
      "acceptanceCriteria": [
        "A reusable styling API exists (e.g., a shared class and/or wrapper component) that can be applied consistently to multiple text panels/cards.",
        "The panel surface is visibly semi-transparent with a backdrop blur (glass effect).",
        "The panel has rounded corners and a subtle shadow at rest.",
        "The panel shows a soft glowing border (not a hard solid outline) that is visible on both light and dark themes.",
        "The style respects existing Tailwind tokens (e.g., card/background/border/primary/accent) so it stays consistent with the site theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Define a reusable glowing glass panel style (e.g., a `.glowing-glass-panel` utility/class) using existing theme tokens (card/background/border/primary/accent). Include semi-transparent surface + backdrop blur, rounded corners, subtle resting shadow, and a soft glow border implemented via a pseudo-element (so it’s not a hard outline) that remains visible in light and dark themes."
        },
        {
          "path": "frontend/src/components/common/GlowingGlassPanel.tsx",
          "operation": "create",
          "description": "Create a small wrapper component that applies the shared glowing glass panel class and accepts `className`/children so it can be composed across text sections/cards without modifying shadcn/ui components."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply the glowing glass panel style to About feature cards, News post cards, and the News Create New Post form (and align loading placeholders) without changing copy or behavior.",
      "acceptanceCriteria": [
        "About section feature cards use the new glowing glass panel style while keeping their existing layout and animations.",
        "NewsPostCard uses the new glowing glass panel style (including transparency, glow border, rounded corners, shadow).",
        "NewPostForm uses the new glowing glass panel style (including transparency, glow border, rounded corners, shadow).",
        "No user-facing copy is changed as part of applying the new styling.",
        "Visual changes are limited to presentation (no changes to backend data flow or feature behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/AboutSection.tsx",
          "operation": "modify",
          "description": "Replace the one-off feature card container styling with the reusable glowing glass panel API (prefer using `GlowingGlassPanel` or the shared class), preserving existing structure, hover effects, and reveal animations."
        },
        {
          "path": "frontend/src/components/news/NewsPostCard.tsx",
          "operation": "modify",
          "description": "Update the news post card container to use the reusable glowing glass panel styling (or `GlowingGlassPanel`) while keeping all existing layout, data formatting, and text intact."
        },
        {
          "path": "frontend/src/components/news/NewPostForm.tsx",
          "operation": "modify",
          "description": "Update the Create New Post form container to use the reusable glowing glass panel styling (or `GlowingGlassPanel`) without altering form validation, submission behavior, or any user-facing copy."
        },
        {
          "path": "frontend/src/components/sections/NewsUpdatesSection.tsx",
          "operation": "modify",
          "description": "Align the loading skeleton placeholder card wrappers with the same glowing glass panel styling so loading and loaded states share the consistent glass/glow look, without changing any copy or logic."
        }
      ]
    }
  ]
}