{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Donation section + navigation link (static Cash App instructions)",
  "requirements": [
    {
      "id": "REQ-100",
      "summary": "Create a new public Donation section with id=\"donation\", cinematic dark styling, and reveal-on-scroll / reduced-motion-safe animation, using the user-provided text verbatim (including \"$WOTWM\").",
      "acceptanceCriteria": [
        "A new section is rendered on the public site with id=\"donation\".",
        "The section shows a visible heading/title: \"Donation\".",
        "The donation body content matches the user-provided text verbatim (including \"$WOTWM\").",
        "The section styling is consistent with existing sections (dark cinematic background, readable typography, spacing).",
        "Animations respect prefers-reduced-motion (no mandatory motion effects when reduced motion is enabled)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/DonationSection.tsx",
          "operation": "create",
          "description": "Add a new <DonationSection /> component that renders a <section> with stable id=\"donation\", a prominent \"Donation\" title, and the exact user-provided donation/support text (including the Cash App handle \"$WOTWM\"). Match existing cinematic dark section patterns (layered background, container spacing, readable typography) and use the existing useRevealOnScroll + usePrefersReducedMotion behavior to ensure reveal animations are reduced-motion-safe. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-101",
      "summary": "Add a \"Donation\" item to HeaderNav that smooth-scrolls to #donation in both desktop and mobile menus while preserving existing scroll targets.",
      "acceptanceCriteria": [
        "Header navigation includes a \"Donation\" item on desktop.",
        "Mobile menu includes a \"Donation\" item.",
        "Clicking \"Donation\" smoothly scrolls to the section with id=\"donation\".",
        "All existing nav items (Story, Characters, Clans, Episodes, Gallery, News) still work and scroll correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/HeaderNav.tsx",
          "operation": "modify",
          "description": "Extend the existing navLinks list to include a new item { href: '#donation', label: 'Donation' } and ensure the existing scrollToSection helper continues to smooth-scroll correctly for both desktop and mobile menus without changing existing targets. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-102",
      "summary": "Wire the Donation section into the homepage flow in App.tsx for both normal public view and Pro mode, near the end of the page before the Footer.",
      "acceptanceCriteria": [
        "Donation section renders in the normal (non-admin) view.",
        "Donation section renders in Pro mode view as well.",
        "No existing sections disappear or lose their current ids/scroll behavior after inserting the Donation section."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and render <DonationSection /> in the main homepage section list and in the Pro mode section list, placing it near the end of the page (e.g., after NewsUpdatesSection and before <Footer />) while preserving existing section order, ids, and behavior. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}