{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Collaboration & Supporter Help forms with admin viewing (frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an interactive Collaboration contact form on the Contact page for public submissions.",
      "acceptanceCriteria": [
        "In `frontend/src/components/sections/ContactSection.tsx`, the existing static “Collaboration” card includes an interactive form (not just display text).",
        "The Collaboration form includes inputs for Name, Email, Optional Social Media Links, and a multiline Message field, plus a Submit button.",
        "Form validation prevents submitting when required fields are missing (at minimum: Name and Message, consistent with `FanMailForm`).",
        "On successful submit, the form resets and a success alert is shown; on failure, an error alert is shown.",
        "Form is usable for unauthenticated visitors (no Internet Identity login required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/CollaborationForm.tsx",
          "operation": "create",
          "description": "Create a Collaboration submission form component modeled after `FanMailForm` (Name + Message required, plus Email and Optional Social Media Links), using existing shadcn-ui components (e.g., Button/Input/Textarea/Label/Alert) for consistent styling and feedback. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Replace the static Collaboration content area with the new `CollaborationForm` while preserving existing Collaboration explanatory content above/around the form; ensure the form remains accessible to unauthenticated visitors and uses English user-facing text. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an interactive Supporter Help contact form on the Contact page for public submissions while keeping the warning visible.",
      "acceptanceCriteria": [
        "In `frontend/src/components/sections/ContactSection.tsx`, the existing static “Supporter Help” card includes an interactive form (not just instructions text).",
        "The Supporter Help form includes inputs for Name, Email, Optional Social Media Links, and a multiline Message field, plus a Submit button.",
        "Form validation prevents submitting when required fields are missing (at minimum: Name and Message, consistent with `FanMailForm`).",
        "On successful submit, the form resets and a success alert is shown; on failure, an error alert is shown.",
        "The existing destructive warning (“ONLY for supporters…”) remains visible above the form."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/SupporterHelpForm.tsx",
          "operation": "create",
          "description": "Create a Supporter Help submission form component modeled after `FanMailForm` (Name + Message required, plus Email and Optional Social Media Links), with success and error alerts and disabled states during submission, using existing shadcn-ui components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/sections/ContactSection.tsx",
          "operation": "modify",
          "description": "Augment the existing Supporter Help section by inserting `SupporterHelpForm` below the existing destructive warning (warning must remain visible above the form), keeping the current instructions text as needed and ensuring all new user-facing text is in English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add React Query hooks for submitting and admin-fetching Collaboration and Supporter Help submissions via the backend actor.",
      "acceptanceCriteria": [
        "In `frontend/src/hooks/useQueries.ts`, add mutations for submitting Collaboration and Supporter Help forms.",
        "In `frontend/src/hooks/useQueries.ts`, add admin queries for fetching all Collaboration submissions and all Supporter Help submissions.",
        "Hooks follow the existing patterns used by `useSubmitFanMail` and `useGetAllFanMail` (React Query keys, actor availability checks, invalidation if needed).",
        "All hooks use English user-facing error messaging consistent with existing UI (e.g., “Failed to send…”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add new React Query hooks: (1) public mutations to submit Collaboration and Supporter Help using the backend actor methods, (2) admin queries to fetch all Collaboration submissions and all Supporter Help submissions for display in the admin UI. Follow existing patterns for actor availability checks, query keys, and consistent English error messages."
        },
        {
          "path": "frontend/src/components/sections/CollaborationForm.tsx",
          "operation": "modify",
          "description": "Wire the Collaboration form component to the new submit mutation hook; ensure success resets fields and shows a success Alert, and failures show a destructive Alert consistent with `FanMailForm`. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/sections/SupporterHelpForm.tsx",
          "operation": "modify",
          "description": "Wire the Supporter Help form component to the new submit mutation hook; ensure success resets fields and shows a success Alert, and failures show a destructive Alert consistent with `FanMailForm`. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add admin dashboard tabs and panels to view Collaboration and Supporter Help submissions (read-only) with detail dialogs.",
      "acceptanceCriteria": [
        "In `frontend/src/components/admin/AdminDashboardView.tsx`, add new TabsTrigger entries for Collaboration and Supporter Help (alongside existing Fan Mail tab).",
        "Create new admin panels (new files under `frontend/src/components/admin/panels/`) to list Collaboration submissions and Supporter Help submissions.",
        "Each panel shows a count of submissions and a scrollable list similar to `FanMailAdminPanel` (read-only is sufficient).",
        "Clicking an item opens a dialog (or equivalent detail view) showing submitted Name, Email, Optional Social Media Links, Message, and submitted date/time.",
        "Panels display loading skeletons and an error alert if the query fails, consistent with `FanMailAdminPanel`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/panels/CollaborationAdminPanel.tsx",
          "operation": "create",
          "description": "Create a read-only admin panel to list Collaboration submissions with count, scrollable list, loading skeletons, and error Alert; clicking an item opens a shadcn-ui Dialog showing full details (Name, Email, Optional Social Media Links, Message, submitted date/time). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/panels/SupporterHelpAdminPanel.tsx",
          "operation": "create",
          "description": "Create a read-only admin panel to list Supporter Help submissions with count, scrollable list, loading skeletons, and error Alert; clicking an item opens a shadcn-ui Dialog showing full details (Name, Email, Optional Social Media Links, Message, submitted date/time). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminDashboardView.tsx",
          "operation": "modify",
          "description": "Add new admin dashboard tabs and content panes for Collaboration and Supporter Help alongside Fan Mail; import and render the new panels, ensuring the tabs are wired and not orphaned. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}