{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Gallery guidelines, featured curation, and advanced metadata filtering (frontend-only)",
  "requirements": [
    {
      "id": "REQ-119",
      "summary": "Add a public Submission Guidelines block to the Gallery section with exact English bullets and cinematic dark styling.",
      "acceptanceCriteria": [
        "Gallery section shows a clearly labeled \"Submission Guidelines\" area visible to all visitors.",
        "The four guideline bullets appear in English and match the requested wording.",
        "The guidelines block matches the site’s existing cinematic dark styling and does not break existing reveal-on-scroll/reduced-motion behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/GallerySection.tsx",
          "operation": "modify",
          "description": "Add a clearly labeled \"Submission Guidelines\" block within the existing Gallery section that renders the four bullets exactly as provided; use existing cinematic dark styling conventions and compose with existing shadcn-ui primitives (e.g., Card/Alert/Typography) for consistent appearance. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-121",
      "summary": "Update React Query hooks/types to read/write extended GalleryItem fields (featured, credit link, artist/title/description, tags) while preserving gallery invalidation behavior.",
      "acceptanceCriteria": [
        "useGetAllGalleryItems returns gallery items including the new fields.",
        "useCreateGalleryItem/useUpdateGalleryItem can send the new fields to the backend.",
        "After creating/updating/deleting gallery items, the public Gallery section updates via the existing query invalidation/refetch pattern."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update gallery-related React Query hooks to align with the current backend interface for GalleryItem (create/update params include artistName, artworkTitle, optional description/creditLink, featured, taggedCharacterIds/taggedClanIds) and keep existing ['galleryItems'] invalidation behavior; add query helpers for featured-only and filtered/sorted gallery reads using the existing backend capability exposed in the actor (without changing invalidation semantics for the main galleryItems query)."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "If generated types are out of sync with the actor interface used by the frontend build (e.g., gallery create/update signatures or GalleryItem fields), update the local type declarations so hooks and UI compile cleanly against the extended GalleryItem shape."
        }
      ]
    },
    {
      "id": "REQ-122",
      "summary": "Enhance Gallery admin management UI to view/edit fan art metadata fields and control Featured state.",
      "acceptanceCriteria": [
        "GalleryAdminPanel list view displays the artist name/username and the credit/social link when present (in addition to existing image preview/title).",
        "Create and Edit dialogs include inputs for artist name/username, artwork title, optional description, and optional credit/social link, with clear English labels.",
        "Create and Edit dialogs include a Featured toggle/checkbox with clear English labeling.",
        "Saving changes persists to the backend and is reflected after refetch (no manual page refresh required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/panels/GalleryAdminPanel.tsx",
          "operation": "modify",
          "description": "Extend the admin list cards to show artistName and creditLink when present; update Create/Edit dialogs to include English-labeled inputs for artistName, artworkTitle, optional description, optional credit/social link, and a Featured toggle/checkbox; wire form submission to the updated useCreateGalleryItem/useUpdateGalleryItem mutations and preserve current refetch behavior. Compose UI using existing shadcn-ui components (Input, Label, Textarea, Select, Checkbox/Switch where available). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/adminContentAdapters.ts",
          "operation": "modify",
          "description": "Review gallery metadata encode/decode helpers so they continue to handle category/alt without overloading the new first-class fan art fields (artistName/artworkTitle/creditLink/featured); keep backward compatibility for existing stored descriptions."
        }
      ]
    },
    {
      "id": "REQ-123",
      "summary": "Add a public Featured Fan Art section/sub-section that highlights admin-featured items and opens the existing lightbox on click.",
      "acceptanceCriteria": [
        "When at least one gallery item is marked Featured in backend data, the public site shows a \"Featured Fan Art\" heading and renders the featured items prominently.",
        "Clicking a featured item opens the existing GalleryLightbox at the correct image.",
        "When there are no featured items, the UI does not show an empty featured grid (either hide the section or show a clear English empty message)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/GallerySection.tsx",
          "operation": "modify",
          "description": "Add a \"Featured Fan Art\" heading and prominent featured grid (or clearly separated sub-section) above/beside the main gallery; source featured items from backend-provided featured field (via a dedicated query helper) and ensure clicking any featured item opens the existing GalleryLightbox at the correct index in the unified gallery items array (id-based index resolution). Use existing cinematic styling and compose with shadcn-ui primitives as needed. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/gallery/GalleryGrid.tsx",
          "operation": "modify",
          "description": "If needed to support the featured sub-section layout without duplicating logic, refactor GalleryGrid to accept optional display variants (e.g., compact/prominent) while preserving existing category-tab behavior and click-to-open semantics. Use existing shadcn-ui Tabs as currently implemented. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-124",
      "summary": "Add public Gallery sorting/filtering controls for character, clan, and popularity, populated from backend Characters/Clans queries and using backend popularity metric.",
      "acceptanceCriteria": [
        "Public Gallery UI provides controls to (1) filter by character, (2) filter by clan, and (3) sort by popularity.",
        "Character and clan filter lists are populated from backend data when available (with a sensible empty/loading behavior if not).",
        "Popularity sorting produces a stable, deterministic ordering based on backend-provided popularity values.",
        "Filtering/sorting does not break existing category behavior in GalleryGrid (category tabs should still hide when irrelevant, per existing logic)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/adjust React Query helpers to retrieve filtered/sorted gallery items using the actor’s existing gallery filtering capability (characterIds, clanIds, sortByPopularity, featuredOnly) while keeping the base ['galleryItems'] query intact for default browsing and maintaining existing invalidation behavior."
        },
        {
          "path": "frontend/src/components/sections/GallerySection.tsx",
          "operation": "modify",
          "description": "Add filter + sort controls to the public Gallery UI: character filter (populated from useGetAllCharacters), clan filter (useGetAllClans), and a popularity sort control; implement sensible loading/empty states, and apply the resulting filtered/sorted gallery items to the existing GalleryGrid while keeping its category tab hiding logic effective. Compose controls using shadcn-ui Select/Tabs/Button primitives as appropriate. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}